# 01: Menyertakan Prefix dan Suffix pada Seluruh Kolom DataFrame

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.5
1.18.5

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows,n_cols)), columns=cols)
df

   A  B  C  D  E
0  7  7  9  9  7
1  1  4  1  7  4
2  3  5  4  6  6
3  2  8  9  5  8
4  3  1  9  3  4

In [3]:
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        7        7        9        9        7
1        1        4        1        7        4
2        3        5        4        6        6
3        2        8        9        5        8
4        3        1        9        3        4

In [4]:
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        7        7        9        9        7
1        1        4        1        7        4
2        3        5        4        6        6
3        2        8        9        5        8
4        3        1        9        3        4

# 02: Pemilihan Baris (Row Selection) pada DataFrame

In [5]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.1
1.18.1

In [6]:
n_rows, n_cols = 10, 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,5, size=(n_rows,n_cols)), columns=cols)
df

   A  B  C  D  E
0  1  2  1  3  1
1  4  2  4  2  1
2  2  4  2  4  1
3  2  2  1  3  2
4  1  4  1  4  2
5  2  4  1  1  3
6  2  2  2  4  3
7  1  2  1  3  2
8  3  3  4  4  3
9  1  4  1  1  4

In [7]:
df[(df['A']==1) | (df['A']==3)] #or

   A  B  C  D  E
0  1  2  1  3  1
4  1  4  1  4  2
7  1  2  1  3  2
8  3  3  4  4  3
9  1  4  1  1  4

In [8]:
df[df['A'].isin([1,3])]

   A  B  C  D  E
0  1  2  1  3  1
4  1  4  1  4  2
7  1  2  1  3  2
8  3  3  4  4  3
9  1  4  1  1  4

In [9]:
df[~df['A'].isin([1,3])] #Negasi

   A  B  C  D  E
1  4  2  4  2  1
2  2  4  2  4  1
3  2  2  1  3  2
5  2  4  1  1  3
6  2  2  2  4  3

# 03: Konversi Tipe Data String ke Numerik pada Kolom DataFrame

In [10]:
import pandas as pd

print(pd.__version__)

1.0.1

In [11]:
data = {'col1':['1','2','3','teks'],
       'col2':['1','2','3','4']}
df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [12]:
df.dtypes

col1    object
col2    object
dtype: object

In [13]:
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [14]:
df_x.dtypes

col1    object
col2     int32
dtype: object

In [15]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

# 04: Pemilihan Kolom (Columns Selection) pada DataFrame Berdasarkan Tipe Data

In [16]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.1
1.18.1

In [17]:
n_rows, n_cols = 5, 2
cols = ['bil_pecahan','bil_bulat']

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows,n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype('float')
df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df = df.reset_index()
df['teks'] = list('ABCDE')

df

C:\ProgramData\Anaconda3\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          5.0         16    A
1 2000-01-01 01:00:00         10.0         14    B
2 2000-01-01 02:00:00          6.0         16    C
3 2000-01-01 03:00:00          7.0         11    D
4 2000-01-01 04:00:00         19.0          7    E

In [18]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [19]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          5.0         16
1         10.0         14
2          6.0         16
3          7.0         11
4         19.0          7

In [20]:
df.select_dtypes(include='float')

   bil_pecahan
0          5.0
1         10.0
2          6.0
3          7.0
4         19.0

In [21]:
df.select_dtypes(include='int')

   bil_bulat
0         16
1         14
2         16
3         11
4          7

In [22]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [23]:
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [24]:
df.select_dtypes(include=['number','object'])

   bil_pecahan  bil_bulat teks
0          5.0         16    A
1         10.0         14    B
2          6.0         16    C
3          7.0         11    D
4         19.0          7    E

In [25]:
df2 = df
df2.sort_values(by=['bil_bulat'], inplace=True)
df2

                index  bil_pecahan  bil_bulat teks
4 2000-01-01 04:00:00         19.0          7    E
3 2000-01-01 03:00:00          7.0         11    D
1 2000-01-01 01:00:00         10.0         14    B
0 2000-01-01 00:00:00          5.0         16    A
2 2000-01-01 02:00:00          6.0         16    C

In [26]:
df2.sort_values(by=['bil_pecahan'], inplace=False)

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          5.0         16    A
2 2000-01-01 02:00:00          6.0         16    C
3 2000-01-01 03:00:00          7.0         11    D
1 2000-01-01 01:00:00         10.0         14    B
4 2000-01-01 04:00:00         19.0          7    E

In [27]:
df2

                index  bil_pecahan  bil_bulat teks
4 2000-01-01 04:00:00         19.0          7    E
3 2000-01-01 03:00:00          7.0         11    D
1 2000-01-01 01:00:00         10.0         14    B
0 2000-01-01 00:00:00          5.0         16    A
2 2000-01-01 02:00:00          6.0         16    C

# 05: Membalik Urutan Baris dan Kolom pada DataFrame

In [28]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.1
1.18.1

In [29]:
n_rows, n_cols = 5, 5
cols = list('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows,n_cols)), columns=cols)
df

   A  B  C  D  E
0  1  4  5  2  7
1  6  9  1  6  8
2  7  6  7  3  2
3  9  2  2  6  6
4  2  8  2  3  1

In [30]:
df.loc[:, ::-1]

   E  D  C  B  A
0  7  2  5  4  1
1  8  6  1  9  6
2  2  3  7  6  7
3  6  6  2  2  9
4  1  3  2  8  2

In [31]:
df.loc[::-1]

   A  B  C  D  E
4  2  8  2  3  1
3  9  2  2  6  6
2  7  6  7  3  2
1  6  9  1  6  8
0  1  4  5  2  7

In [32]:
df.loc[::-1].reset_index()

   index  A  B  C  D  E
0      4  2  8  2  3  1
1      3  9  2  2  6  6
2      2  7  6  7  3  2
3      1  6  9  1  6  8
4      0  1  4  5  2  7

In [33]:
df.loc[::-1].reset_index(drop="True")

   A  B  C  D  E
0  2  8  2  3  1
1  9  2  2  6  6
2  7  6  7  3  2
3  6  9  1  6  8
4  1  4  5  2  7

# 06: Mengganti Nama (Label) Kolom pada DataFrame

In [34]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.1
1.18.1

In [35]:
n_rows, n_cols = 5, 5
cols = list('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows,n_cols)), columns=cols)
df

   A  B  C  D  E
0  8  1  1  7  4
1  4  6  6  3  2
2  6  5  9  4  6
3  5  8  2  3  9
4  2  7  4  2  7

In [36]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  8  1     1  7  4
1  4  6     6  3  2
2  6  5     9  4  6
3  5  8     2  3  9
4  2  7     4  2  7

In [37]:
df

   A  B  C  D  E
0  8  1  1  7  4
1  4  6  6  3  2
2  6  5  9  4  6
3  5  8  2  3  9
4  2  7  4  2  7

In [38]:
df.rename(columns={'C':'Hobi'}, inplace=True)
df

   A  B  Hobi  D  E
0  8  1     1  7  4
1  4  6     6  3  2
2  6  5     9  4  6
3  5  8     2  3  9
4  2  7     4  2  7

In [39]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  Hobi  Kota  E
0     8       1     1     7  4
1     4       6     6     3  2
2     6       5     9     4  6
3     5       8     2     3  9
4     2       7     4     2  7

# 07: Menghapus (drop) Missing Values (NaN)

In [40]:
import pandas as pd

print(pd.__version__)

1.0.1

In [41]:
df = pd.util.testing.makeMissingDataFrame().reset_index()
df

AttributeError: module 'pandas.util.testing' has no attribute 'makeMissingDataFrame'

In [42]:
data = {'col1':['1','2','3','teks'],
       'col2':['1','2','3','4']}
df = pd.DataFrame(data)
df = df.apply(pd.to_numeric, errors='coerce')
df

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

In [43]:
df = df.rename(columns={'col1':'A', 'col2':'B'})
df

     A  B
0  1.0  1
1  2.0  2
2  3.0  3
3  NaN  4

In [44]:
df_backup = df.copy(deep=True)

In [45]:
df = df.dropna(axis='rows')
df

     A  B
0  1.0  1
1  2.0  2
2  3.0  3

In [46]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='columns')
df

   B
0  1
1  2
2  3
3  4

In [47]:
df = df_backup.copy(deep=True)
df.isna().mean()

A    0.25
B    0.00
dtype: float64

In [48]:
threshold = len(df) * 0.8
df = df.dropna(thresh=threshold, axis='columns')
df

   B
0  1
1  2
2  3
3  4

# 08: Memeriksa Kesamaan antar Dua Buah Kolom (Series) pada DataFrame

In [49]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.1
1.18.1

In [50]:
data = {'A':[15,15,18, np.nan, 12], 'B':[15,15,18, np.nan, 12]}
df = pd.DataFrame(data)
df

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [51]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [52]:
type(df['A'])

pandas.core.series.Series

In [53]:
type(df)

pandas.core.frame.DataFrame

In [54]:
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [55]:
df['A'].equals(df['B'])

True

In [56]:
df1 = df.copy(deep=True)
df1.equals(df)

True

In [57]:
df1 == df

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True

# 09: Membagi DataFrame Menjadi Dua Secara Acak

In [58]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.1
1.18.1

In [59]:
n_rows, n_cols = 10, 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows,n_cols)), columns=cols)
df

    A   B   C   D   E
0   9   4   1  15   1
1   3  18  19  11  10
2  16   6  15  14  17
3   9  18   5  13   1
4   2  12   7  12  16
5  17   6  16   5   7
6   2   5   4   8  11
7  12  17  18   1  17
8  12   1  13  13   9
9  16   6   2  15  19

In [60]:
df.shape

(10, 5)

In [61]:
proporsi = 0.7

df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape : {df_1.shape}')
print(f'df_2 shape : {df_2.shape}')

df_1 shape : (7, 5)
df_2 shape : (3, 5)

In [62]:
df_1

    A   B   C   D   E
6   2   5   4   8  11
2  16   6  15  14  17
5  17   6  16   5   7
4   2  12   7  12  16
3   9  18   5  13   1
1   3  18  19  11  10
9  16   6   2  15  19

In [63]:
df_2

    A   B   C   D   E
0   9   4   1  15   1
7  12  17  18   1  17
8  12   1  13  13   9

# 10: Mengganti Nama (Label) Kolom DataFrame Berdasarkan Pola

In [2]:
import pandas as pd

print(pd.__version__)

1.0.5

In [3]:
from google.colab import files

uploaded = files.upload()

ModuleNotFoundError: No module named 'google'

In [4]:
df = pd.read_csv('./dataset/titanicfull.csv')
df.columns = ['Pclass', 'Survival status', 'full Name', 'Sex ', ' Age',
           'Sib SP', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']
df_backup = df.copy(deep=True)
df.head()

,Pclass,Survival status,full Name,Sex,Age,Sib SP,Parch,Ticket,Fare,Cabin,Embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [5]:
df.columns = df.columns.str.replace(' ','_').str.lower()
df.head()

,pclass,survival_status,full_name,sex_,_age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [6]:
df = df_backup.copy(deep=True)

df.columns = df.columns.str.lower().str.strip().str.replace(' ','_')
df.head()

,pclass,survival_status,full_name,sex,age,sib_sp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

# 11: Melakukan Seleksi Kolom dan Baris pada DataFrame Menggunakan loc

In [7]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.5
1.18.5

In [8]:
n_rows, n_cols = 10, 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows,n_cols)),columns=cols)
df

    A   B   C   D   E
0  14  19   6   9   9
1  15   7   3  11   8
2   5   8  11  16  11
3   6  16   6   6   7
4  16   6  12  19  11
5   3   2  16  14  11
6  12   4  13  15  17
7  13   4  14  14  13
8  12   2  17  13   1
9  16  12   5  11   9

In [9]:
df.loc[[0,3,4],['B','E']]

    B   E
0  19   9
3  16   7
4   6  11

In [10]:
df.loc[df['B']>10,['B','D','E']]

    B   D  E
0  19   9  9
3  16   6  7
9  12  11  9

In [11]:
df.loc[0:4,'B':'D']

    B   C   D
0  19   6   9
1   7   3  11
2   8  11  16
3  16   6   6
4   6  12  19

# 12: Membentuk Kolom Bertipe datetime dari Sejumlah Kolom Lain pada DataFrame

In [12]:
import pandas as pd

print(pd.__version__)

1.0.5

In [13]:
data = {'day':[1,2,10,25,12],
       'month':[1,2,4,5,6],
       'year':[2000,2001,2010,2015,2020]}
df = pd.DataFrame(data)
df

   day  month  year
0    1      1  2000
1    2      2  2001
2   10      4  2010
3   25      5  2015
4   12      6  2020

In [14]:
df['penanggalan'] = pd.to_datetime(df[['day','month','year']])
df

   day  month  year penanggalan
0    1      1  2000  2000-01-01
1    2      2  2001  2001-02-02
2   10      4  2010  2010-04-10
3   25      5  2015  2015-05-25
4   12      6  2020  2020-06-12

In [15]:
df.dtypes

day                     int64
month                   int64
year                    int64
penanggalan    datetime64[ns]
dtype: object

# 13: Konversi Nilai Numerik ke dalam Sejumlah Kategori

In [79]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.1
1.18.1

In [80]:
n_rows, n_cols = 10, 1
df = pd.DataFrame(np.random.randint(1,99, size=(n_rows,n_cols)), columns=['usia'])
df

   usia
0    66
1    53
2    70
3    88
4    28
5    61
6    10
7    12
8    62
9    15

In [81]:
df['kelompok_usia'] = pd.cut(df['usia'],
                            bins=[1,18,65,99],
                            labels=['anak','dewasa','manula'])
df

   usia kelompok_usia
0    66        manula
1    53        dewasa
2    70        manula
3    88        manula
4    28        dewasa
5    61        dewasa
6    10          anak
7    12          anak
8    62        dewasa
9    15          anak

# 14: Menggabungkan (merge) Dua DataFrame

In [82]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.1
1.18.1

In [83]:
n_rows, n_cols = 5, 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows,n_cols)), columns=cols)
df

    A   B   C   D   E
0   8   8   6  14  14
1  16   7   5  15  16
2  15  17  19   5  11
3   4  12   7   5  17
4   7  18  14   3  12

In [84]:
df1 = df.copy(deep=True)
df1 = df1.drop([1,4])
df1

    A   B   C   D   E
0   8   8   6  14  14
2  15  17  19   5  11
3   4  12   7   5  17

In [85]:
df2 = df.copy(deep=True)
df2 = df2.drop([0,3])
df2

    A   B   C   D   E
1  16   7   5  15  16
2  15  17  19   5  11
4   7  18  14   3  12

In [86]:
df_inner = pd.merge(df1,df2, how='inner')
df_inner

    A   B   C  D   E
0  15  17  19  5  11

In [87]:
df_outer = pd.merge(df1,df2, how='outer')
df_outer

    A   B   C   D   E
0   8   8   6  14  14
1  15  17  19   5  11
2   4  12   7   5  17
3  16   7   5  15  16
4   7  18  14   3  12

In [88]:
df_outer.equals(df)

False

# 15: Memecah Nilai String dari Suatu Kolom ke dalam Beberapa Kolom Baru

In [89]:
import pandas as pd

print(pd.__version__)

1.0.1

In [90]:
data = {'nama':['Didi Kempot','Glenn Fredly','Mbah Surip'],
       'tempat_kelahiran':['Surakarta, Jawa Tengah','Jakarta, DKI Jakarta','Mojokerto, Jawa Timur']}
df = pd.DataFrame(data)
df

           nama        tempat_kelahiran
0   Didi Kempot  Surakarta, Jawa Tengah
1  Glenn Fredly    Jakarta, DKI Jakarta
2    Mbah Surip   Mojokerto, Jawa Timur

In [91]:
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)
df

           nama        tempat_kelahiran nama_depan nama_belakang
0   Didi Kempot  Surakarta, Jawa Tengah       Didi        Kempot
1  Glenn Fredly    Jakarta, DKI Jakarta      Glenn        Fredly
2    Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

In [92]:
df[['kota', 'provinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,provinsi
0,Didi Kempot,"Surakarta, Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glenn Fredly,"Jakarta, DKI Jakarta",Glenn,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur

In [93]:
df = df.drop(columns=['nama','tempat_kelahiran'])
df

  nama_depan nama_belakang       kota      provinsi
0       Didi        Kempot  Surakarta   Jawa Tengah
1      Glenn        Fredly    Jakarta   DKI Jakarta
2       Mbah         Surip  Mojokerto    Jawa Timur

# 16: Menata Ulang DataFrame dengan Multiple Indexes Menggunakan unstack()

In [94]:
import pandas as pd

print(pd.__version__)

1.0.1

In [95]:
df = pd.read_csv('./dataset/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

In [96]:
df.groupby(['sex', 'pclass'])['survived'].mean().to_frame()

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

In [97]:
df.groupby(['sex', 'pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

# 17: Resampling pada Data Deret Waktu (time series data)

In [17]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.5
1.18.5

In [23]:
n_rows, n_cols = 365*24, 2
cols = ['col1', 'col2']

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows,n_cols)), columns=cols)

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df

                     col1  col2
2000-01-01 00:00:00     2     2
2000-01-01 01:00:00     4     9
2000-01-01 02:00:00     1     9
2000-01-01 03:00:00     2    17
2000-01-01 04:00:00     1     2
...                   ...   ...
2000-12-30 19:00:00     4     8
2000-12-30 20:00:00     6     5
2000-12-30 21:00:00     5     7
2000-12-30 22:00:00    19     9
2000-12-30 23:00:00    19     2

[8760 rows x 2 columns]

In [24]:
df.resample('M')['col1'].sum().to_frame()

            col1
2000-01-31  7307
2000-02-29  6999
2000-03-31  7577
2000-04-30  7369
2000-05-31  7436
2000-06-30  7161
2000-07-31  7564
2000-08-31  7238
2000-09-30  7220
2000-10-31  7694
2000-11-30  7092
2000-12-31  6985

In [25]:
df.resample('D')['col1'].sum().to_frame()

            col1
2000-01-01   215
2000-01-02   190
2000-01-03   242
2000-01-04   262
2000-01-05   237
...          ...
2000-12-26   215
2000-12-27   229
2000-12-28   225
2000-12-29   260
2000-12-30   276

[365 rows x 1 columns]

# 18: Membentuk Dummy DataFrame

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.0.5
1.18.5

In [2]:
pd.DataFrame({'col1':[1,2,3,4],
             'col2':[5,6,7,8]})

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

In [3]:
n_rows, n_cols = 5, 3
arr = np.random.randint(1,20, size=(n_rows,n_cols))
arr

array([[11, 10,  3],
       [12, 18,  6],
       [ 4,  2, 16],
       [ 7,  9, 15],
       [ 1, 12,  8]])

In [4]:
cols = tuple('ABC')
df = pd.DataFrame(arr, columns=cols)
df

    A   B   C
0  11  10   3
1  12  18   6
2   4   2  16
3   7   9  15
4   1  12   8

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
arr=df.values
arr

array([[11, 10,  3],
       [12, 18,  6],
       [ 4,  2, 16],
       [ 7,  9, 15],
       [ 1, 12,  8]])

In [7]:
type(arr)

numpy.ndarray

### Membentuk DataFrame dengan Memanfaatkan pandas.util.testing

In [8]:
pd.util.testing.makeDataFrame().head()

C:\Users\User\anaconda3\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                   A         B         C         D
JaOMwXipPi  0.331496  0.719096  0.856529 -0.132810
coT2V4FnkX -0.374433  0.923055  0.341011 -0.872357
za66TrHrbW  2.244884  1.441566  1.743394 -0.196936
WlgYlyeH2w -0.539520 -0.348509 -1.803583 -1.090167
6FR63bvrp1 -1.752686 -0.946611  0.263472 -1.258337

In [9]:
pd.util.testing.makeMixedDataFrame().head()

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [10]:
pd.util.testing.makeTimeDataFrame().head()

                   A         B         C         D
2000-01-03  0.108443 -1.141187 -0.756561  0.229866
2000-01-04  0.151478  0.751534  0.070754  0.010101
2000-01-05  0.537966 -1.664794 -0.511078  2.015851
2000-01-06  1.034108  1.619002 -1.360149 -0.641241
2000-01-07  0.466942  0.842212 -1.226110 -0.004995

In [11]:
pd.util.testing.makeMissingDataframe().head()

                   A         B         C         D
BNBjhmXxAk  0.447296 -1.461362 -0.756879  0.843172
6JFIO6scis  0.244018 -0.474808  2.061272 -2.017759
OJuTJFExPm -0.644497 -0.278584 -0.543233  0.371503
0yv6vpMM9K -0.166259 -0.382013 -0.300732 -1.711531
EgHBvqOnqh -1.225664 -0.341077 -0.558645 -1.653194

# 19: Formatting tampilan DataFrame